// 创建页面实例对象
Page({
  data: {
    viewId: '', // 锚点跳转的id
    /** 目录列表 */
    directoryList: [
      {
        id: '1',
        name: '1.我们是谁？'
      },
      {
        id: '2',
        name: '2.本隐私政策涵盖哪些信息？'
      },
      {
        id: '3',
        name: '3.我们向您收集哪些信息？'
      },
      {
        id: '4',
        name: '4.我们如何使用您的个人信息？'
      },
      {
        id: '5',
        name: '5.我们如何使用Cookies？'
      },
      {
        id: '6',
        name: '6.我们与哪些第三方共享您的个人信息？'
      },
      {
        id: '7',
        name: '7.我们是否将您的个人信息传输出境？'
      },
      {
        id: '8',
        name: '8.您有什么权利？'
      },
      {
        id: '9',
        name: '9.我们如何保护您的个人信息？'
      },
      {
        id: '10',
        name: '10.我们将保存您的个人信息多久？'
      },
      {
        id: '11',
        name: '11.我们如何处理儿童的个人信息？'
      },
      {
        id: '12',
        name: '12.如何联系我们？'
      },
      {
        id: '13',
        name: '13.本隐私政策的哪个版本适用？'
      }
    ],
    /** 如何使用个人信息表格 */
    usageTableList: [
      {
        id: 1,
        goal: '处理您的付款请求并完成您的订单或您所要求的服务。',
        legalBasis: '履行您与我们的买卖合同或您所要求的服务的必要。'
      },
      {
        id: 2,
        goal: '为您创建个人账户，并允许您使用该账户。',
        legalBasis: '<div>履行我们向您提供服务的合同（个人账户）的必要。<br/>基于您的同意（针对于可选填信息）。</div>'
      },
      {
        id: 3,
        goal: '在我们网站上使用您的个人账户（例如保存账单详情及邮寄地址以备将来购买产品、保存相关数据以处理产品退换货），向您提供优化的客户体验（例如便利并加快您的在线交易）。',
        legalBasis: '<div>基于您的同意，在我们的网站上为您提供优化的客户体验。优化客户体验也使您从中获益。<br/>对于某些特定数据的使用（例如用于处理产品退换货），我们必须使用您的信息以履行您与我们的合同。</div>'
      },
      {
        id: 4,
        goal: '个性化并优化您在我们的线上平台购物的体验（例如记录您过去购买的信息（如地址），以便在您将来的购买中重复使用，及保存您最喜爱的门店位置）。',
        legalBasis: '基于您的同意，在我们的网站上为您提供优化的客户体验。优化客户体验也使您从中获益。'
      },
      {
        id: 5,
        goal: '使您能够在线使用我们的“愿望清单”功能（即使您尚未注册在线个人账户），以便在我们的网站上为您提供优化客户体验（例如便利并加快您的在线交易）。',
        legalBasis: '基于您的同意，在我们的网站上为您提供优化的客户体验。优化客户体验也使您从中获益。'
      },
      {
        id: 6,
        goal: '为您提供与您所购买的产品有关的任何咨询或请求的客服支持。',
        legalBasis: '<div>履行您与我们的买卖合同（如我们与您签订的合同中约定了咨询或请求的客服支持）的必要。<br/>遵守我们须遵守的法律义务（如存在要求我们答复您的具体咨询或使您能够行使消费者权利的法律义务，例如《消费者权益保护法》）的必要。</div>'
      },
      {
        id: 7,
        goal: '为您提供与您想购买的产品有关的任何咨询或请求，或提供任何一般的咨询或请求的客服支持。',
        legalBasis: '基于您的同意，与您建立或维持关系。当您与我们联系时，收到我们的回复也符合您的利益。'
      },
      {
        id: 8,
        goal: '使用您在我们的网站或通过第三方提供的产品评论。获得对我们产品的反馈并将使用该反馈改进我们在网站上向其他潜在客户展示我们产品的方式。',
        legalBasis: '基于您的同意，获得您对我们产品的反馈并将使用该反馈改进我们在网站上向其他潜在客户展示我们产品的方式。'
      },
      {
        id: 9,
        goal: '定制您特别要求的产品。',
        legalBasis: '履行您与我们的合同的必要。'
      },
      {
        id: 10,
        goal: '检视我们在线广告的有效性和我们的营销活动（例如检视您是否/何时/如何与在线广告或来自我们的电子邮件互动），并基于此丰富您的个性化标签。改进我们的营销策略以扩大我们的客户基础，保留现有客户，及更好地分配我们的营销资源。',
        legalBasis: '基于您的同意，丰富您的个性化标签，改进我们的营销策略以扩大我们的客户基础，保留现有客户，及更好地分配我们的营销资源。'
      },
      {
        id: 11,
        goal: '根据您的个人信息、我们（或我们信任的服务供应商）在此基础上进行的分析和预测，归纳出您的特征、需求、爱好及习惯，并据此为您提供个性化的产品和服务、活动邀请、广告、展示和营销通讯等，及让您高效地接触并浏览我们广泛的产品和服务。',
        legalBasis: '基于您的同意，向您展示我们认为您喜欢的产品，让您高效的浏览我们广泛的产品和服务，也符合您的利益。'
      },
      {
        id: 12,
        goal: '根据您的个人信息、我们（或我们信任的服务供应商）在此基础上进行的分析和预测，执行（或通过我们信任的服务供应商执行）我们的广告服务、营销方案或其他决策建议。',
        legalBasis: '基于您的同意，执行我们的广告服务、营销方案或其他决策建议。'
      },
      {
        id: 13,
        goal: '通过线上平台的平台内通讯方式（例如推送信息、站内信、线上聊天工具等）、电子邮件、平邮或短信（如果您通过我们的店内客户信息登记卡或在线方式提供该等信息）与您联系，告知您购买我们的产品、优惠和活动信息。',
        legalBasis: '在适用法律要求的情况下，基于您的同意（取决于所使用的通讯方式）使您了解您的购物和我们的产品。您可以随时取消订阅我们的营销信息。'
      },
      {
        id: 14,
        goal: '对我们产品在各个渠道的销售表现或其受关注情况进行评估、统计和分析，进行有关我们的产品和客户体验、产品开发及产品测试的研究和调查，不断改进我们向您和/或其他顾客提供的产品和服务。',
        legalBasis: '基于您的同意，不断改进我们向您提供的产品和服务。在取得您单独同意的特定情况下，会基于该等目的向我们位于美国的总部Tapestry, Inc.提供您的姓名、手机号、邮箱（如有）、会员号、地址/居住地（如有）、消费记录、微信ID（如有）、性别（如有）、年龄段（如有）、会员管理相关信息（如有）、活动/项目参与信息（如有）、满意度调研反馈等信息，您可随时退订相关邮件，也可随时通过下文“如何联系我们？”所述方式联系以实现您的个人信息保护权益。'
      },
      {
        id: 15,
        goal: '使您能够参加我们为客户举办的比赛、抽奖、竞赛、促销活动及类似的活动，以吸引和留住客户，激励客户购买我们的产品或奖励我们的客户。',
        legalBasis: '<div>履行您与我们订立的合同（基于您接受参与我们的比赛、抽奖、竞赛及其他促销活动的条款和条件）的必要。<br/>基于您的同意，吸引和留住客户，激励客户购买我们的产品或奖励我们的客户。</div>'
      },
      {
        id: 16,
        goal: '为我们的客户提供更好的定制服务和包括港澳门店统一积分及会员权益服务在内的客户服务，以吸引和留住客户，激励客户购买我们的产品或奖励我们的客户。',
        legalBasis: '基于您的同意，吸引和留住客户，激励客户购买我们的产品或奖励我们的客户。您从我们提供的优惠中受益也符合您作为客户的利益。当您在港澳门店购物时，基于您的单独同意，隶属于Coach Hong Kong Limited及其分支机构的当地店员仅会处理您的姓名、性别、手机号、会员号、会员状态、会员类型、消费记录、折扣信息、积分、邮箱（如有）、座机号（如有）、生日（如有）、国籍（如有）、地址（如有）、所在城市（如有）、邮编（如有）等信息以为您提供积分及会员权益相关服务，您可随时撤回同意，也可通过下文“如何联系我们？”所述方式联系以实现您的个人信息保护权益。'
      },
      {
        id: 17,
        goal: '通过我们的线上平台与您互动以及您的其他个人信息，评估我们线上平台活动的有效性，并通过线上平台实现上述某些业务目的（例如广告、推广资源，使您能够参加我们的比赛、抽奖、调查等），以扩大和保持我们的客户群，并通过线上平台推广我们的产品。',
        legalBasis: '基于您的同意，通过线上平台推广我们的产品。您可以随时取消关注我们的社交媒体官方账号。'
      },
      {
        id: 18,
        goal: '使您能够自愿参与我们的社交媒体活动，包括使用您的照片/图像。',
        legalBasis: '<div>履行您与我们签订的合同（基于您接受参与我们的该等活动的条款和条件）的必要。<br/>基于您的同意以扩大和保持我们的客户群，并通过社会媒体推广我们的产品。</div>'
      },
      {
        id: 19,
        goal: '门店采集的闭路电视录像，用于维护公共场所（即门店）的安全与店内财产安全，并在发生客户投诉或纷争时作为支持性证据。',
        legalBasis: '<div>基于您的同意。<br/>遵守我们必须遵守的法律要求的必要。</div>'
      },
      {
        id: 20,
        goal: '改进我们网站的功能和用户友好性，不断监测和改善我们的线上服务。',
        legalBasis: '基于您的同意，不断监测和改善我们的线上服务。'
      },
      {
        id: 21,
        goal: '对在线支付进行欺诈检测，就更广泛意义而言，防止任何非法活动。',
        legalBasis: '履行您与我们的合同（包括通过履行我们的合同义务以确保您支付信息的安全性和保密性）的必要。'
      },
      {
        id: 22,
        goal: '支持诸如合并或收购之类的公司交易，其中信息资产必须作为交易的一部分进行合并或转移。',
        legalBasis: '<div>遵守我们必须遵守的法律要求的必要。<br/>基于您的同意。</div>'
      },
      {
        id: 23,
        goal: '答复或处理执法部门、监管机构或其他公共部门的询问或要求。',
        legalBasis: '遵守我们必须遵守的法律要求的必要。'
      }
    ],
    /** 第三方共享列表 */
    thirdTableList: [
      {
        flatName: 'COACH蔻驰官方平台微信小程序',
        SDK: 'Grata客服',
        ability: '线上客服',
        informationType: '无',
        thirdName: '北京利安创新软件有限公司'
      },
      {
        flatName: 'COACH蔻驰官方平台微信小程序',
        SDK: '腾讯有数',
        ability: '全触点多链路经营分析',
        informationType: '埋点数据',
        thirdName: '深圳市腾讯计算机系统有限公司'
      },
      {
        flatName: 'COACH蔻驰官方平台微信小程序',
        SDK: '腾讯位置服务',
        ability: '地图服务',
        informationType: '设备标识、网络类型、网络设备硬件地址MAC、手机屏幕密度/尺寸/设备型号/系统版本',
        thirdName: '深圳市腾讯计算机系统有限公司'
      },
      {
        flatName: 'COACH蔻驰官方平台微信小程序',
        SDK: 'WxJava',
        ability: '支持微信支付、开放平台、公众号、企业号/企业微信、小程序等的后端开发',
        informationType: '无',
        thirdName: 'Github'
      },
      {
        flatName: 'COACH蔻驰官方平台微信小程序',
        SDK: 'wx_track',
        ability: '用户行为追踪、事件追踪',
        informationType: '用户浏览、点击行为',
        thirdName: '安客诚信息服务（上海）有限公司'
      },
      {
        flatName: 'COACH蔻驰官方平台微信小程序',
        SDK: '神策微信小程序SDK',
        ability: '用户行为数据采集',
        informationType: '用户在小程序里的浏览、点击等交互行为数据、union id、 open id',
        thirdName: '神策网络科技（北京）有限公司'
      },
      {
        flatName: 'COACH蔻驰奥莱官方平台微信小程序',
        SDK: 'Grata客服',
        ability: '线上客服',
        informationType: '无',
        thirdName: '北京利安创新软件有限公司'
      },
      {
        flatName: 'COACH蔻驰奥莱官方平台微信小程序',
        SDK: '腾讯位置服务',
        ability: '地图服务',
        informationType: '设备标识、网络类型、网络设备硬件地址MAC、手机屏幕密度/尺寸/设备型号/系统版本',
        thirdName: '深圳市腾讯计算机系统有限公司'
      },
      {
        flatName: 'COACH蔻驰奥莱官方平台微信小程序',
        SDK: 'WxJava',
        ability: '支持微信支付、开放平台、公众号、企业号/企业微信、小程序等的后端开发',
        informationType: '无',
        thirdName: 'Github'
      },
      {
        flatName: 'COACH蔻驰奥莱官方平台微信小程序',
        SDK: '神策微信小程序SDK',
        ability: '用户行为数据采集',
        informationType: '用户在小程序里的浏览、点击等交互行为数据、union id、 open id',
        thirdName: '神策网络科技（北京）有限公司'
      }
    ]
  },
  // 生命周期函数--监听页面加载
  onLoad () {
  },
  getViewId (e) {
    this.setData({
      viewId: 'catalog' + e.currentTarget.dataset.index
    })
    console.log(this.data.viewId)
  }
})
